{
  "adam": {
    "id": "adam",
    "name": "حضرت آدم علیہ السلام",
    "title": "قصہ حضرت آدم علیہ السلام",
    "summary": "حضرت آدم علیہ السلام پہلے انسان اور پہلے نبی ہیں جنہیں اللہ تعالیٰ نے انسانیت کی ہدایت کے لیے مٹی سے پیدا فرمایا۔",
    "story": [
      "اللہ تعالیٰ نے حضرت آدم علیہ السلام کو مٹی سے پیدا کیا اور پھر ان میں اپنی روح پھونکی۔ اللہ نے آدم علیہ السلام کو تمام اشیاء کے نام سکھائے، جو علم میں انسان کی فضیلت اور برتری کی نشانی ہے۔",
      "اللہ نے فرشتوں کو حکم دیا کہ وہ آدم علیہ السلام کو (تعظیمی) سجدہ کریں۔ ابلیس کے علاوہ تمام فرشتوں نے اطاعت کی۔ ابلیس نے تکبر کی وجہ سے انکار کر دیا کیونکہ وہ سمجھتا تھا کہ وہ آگ سے پیدا ہونے کی وجہ سے مٹی سے پیدا ہونے والے آدم سے افضل ہے۔",
      "حضرت آدم علیہ السلام اور ان کی زوجہ حضرت حوا علیہ السلام جنت میں رہتے تھے۔ اللہ نے انہیں ایک مخصوص درخت کے قریب جانے سے منع فرمایا تھا، لیکن ابلیس نے انہیں بہکایا اور آخر کار انہوں نے اس درخت کا پھل کھا لیا۔",
      "اپنی غلطی کا احساس ہوتے ہی حضرت آدم اور حضرت حوا نے صدقِ دل سے توبہ کی اور اللہ سے معافی مانگی۔ اللہ نے ان کی توبہ قبول فرمائی اور انہیں زمین پر اپنا خلیفہ (نائب) بنا کر بھیج دیا۔",
      "زمین پر حضرت آدم علیہ السلام نے انسانوں کو توحید، عبادت اور صحیح زندگی گزارنے کا طریقہ سکھایا۔ وہ اپنی اولاد کو اللہ کی فرمانبرداری کی طرف بلانے والے پہلے نبی بنے۔"
    ],
    "lessons": [
      "تکبر ابلیس کی صفت ہے جس سے بچنا لازمی ہے۔",
      "اللہ کی بارگاہ میں توبہ کا دروازہ ہمیشہ کھلا رہتا ہے۔",
      "انسان کی تخلیق کا مقصد اللہ کی عبادت اور زمین پر اس کی نیابت ہے۔"
    ],
    "refs": ["سورہ البقرہ 30-39", "سورہ الاعراف 11-27", "سورہ طہ 115-123"]
  },

  "nuh": {
    "id": "nuh",
    "name": "حضرت نوح علیہ السلام",
    "title": "قصہ حضرت نوح علیہ السلام",
    "summary": "حضرت نوح علیہ السلام کو ان کی قوم کی طرف بھیجا گیا جو بت پرستی میں مبتلا تھی، آپ نے سینکڑوں سال نہایت صبر کے ساتھ تبلیغ فرمائی۔",
    "story": [
      "حضرت نوح علیہ السلام کو ان کی قوم کی طرف بھیجا گیا جو توحید سے بھٹک کر بتوں کی پوجا کر رہی تھی۔ آپ نے انہیں دعوت دی کہ وہ صرف ایک اللہ کی عبادت کریں اور شرک کو چھوڑ دیں۔",
      "حضرت نوح علیہ السلام نے ساڑھے نو سو (950) سال تک صبر کے ساتھ دن رات، اعلانیہ اور خفیہ طور پر تبلیغ کی، لیکن بہت ہی کم لوگ ایمان لائے۔",
      "آپ کی قوم نے آپ کا مذاق اڑایا، جھٹلایا اور آپ پر طرح طرح کے الزامات لگائے۔ ان تمام تکالیف کے باوجود آپ اپنے مقصد پر ڈٹے رہے اور صبر و استقامت کا دامن نہ چھوڑا۔",
      "جب قوم کی سرکشی حد سے بڑھ گئی تو اللہ نے حضرت نوح کو ایک بڑی کشتی بنانے کا حکم دیا۔ اہل ایمان اور جانوروں کے جوڑے اس کشتی میں سوار ہو گئے۔ پھر اللہ نے ایک عظیم طوفان بھیجا جس نے منکرین کو غرق کر دیا۔",
      "حضرت نوح علیہ السلام کی کشتی سلامتی کے ساتھ جودی پہاڑ پر جا ٹھہری۔ یہ قصہ اس بات کی علامت ہے کہ کامیابی صرف ایمان اور اللہ کی اطاعت میں ہے۔"
    ],
    "lessons": [
      "دعوت و تبلیغ کے کام میں صبر بنیادی شرط ہے۔",
      "حق کی پہچان پیروکاروں کی تعداد سے نہیں ہوتی۔",
      "نجات صرف اللہ پر ایمان اور اس کی فرمانبرداری میں ہے۔"
    ],
    "refs": ["سورہ ہود 25-49", "سورہ نوح", "سورہ المومنون 23-30"]
  },

  "ibrahim": {
    "id": "ibrahim",
    "name": "حضرت ابراہیم علیہ السلام",
    "title": "قصہ حضرت ابراہیم علیہ السلام",
    "summary": "حضرت ابراہیم علیہ السلام کو 'ابوالانبیاء' (نبیوں کا باپ) کہا جاتا ہے، آپ توحید اور ایمان پر استقامت کی بہترین مثال ہیں۔",
    "story": [
      "حضرت ابراہیم علیہ السلام بت پرست معاشرے میں پیدا ہوئے۔ آپ نے اپنی عقل اور بصیرت سے ثابت کیا کہ بت بے بس ہیں اور عبادت کے لائق صرف اللہ کی ذات ہے۔",
      "آپ نے اپنی قوم کے بتوں کو توڑ کر ان کی بے بسی ظاہر کی۔ قوم نے غصے میں آ کر آپ کو دہکتی ہوئی آگ میں ڈال دیا، لیکن اللہ کے حکم سے وہ آگ آپ کے لیے ٹھنڈی اور سلامتی والی بن گئی۔",
      "حضرت ابراہیم علیہ السلام نے توحید کی دعوت جاری رکھی اور ایمان کی حفاظت کے لیے اپنا گھر بار چھوڑ کر ہجرت کی۔",
      "اللہ نے آپ کو بیٹے حضرت اسماعیل کی قربانی کے حکم سے آزمایا۔ باپ اور بیٹے دونوں اللہ کے حکم کے سامنے سرِ تسلیم خم ہو گئے، لیکن اللہ نے حضرت اسماعیل کی جگہ ایک مینڈھے کی قربانی قبول فرمائی۔",
      "حضرت ابراہیم علیہ السلام نے اپنے بیٹے حضرت اسماعیل کے ساتھ مل کر خانہ کعبہ کی تعمیر کی، جو رہتی دنیا تک توحید کا مرکز قرار پایا۔"
    ],
    "lessons": [
      "سخت ترین آزمائش میں بھی توحید پر قائم رہنا چاہیے۔",
      "اللہ کی اطاعت ہر رشتے اور مفاد سے بالاتر ہے۔",
      "آزمائشیں اللہ کے مقرب بندوں کے لیے اس کی محبت اور درجات کی بلندی کا ذریعہ ہیں۔"
    ],
    "refs": ["سورہ الانبیاء 51-70", "سورہ الصافات 99-111", "سورہ البقرہ 124-129"]
  },

  "musa": {
    "id": "musa",
    "name": "حضرت موسیٰ علیہ السلام",
    "title": "قصہ حضرت موسیٰ علیہ السلام",
    "summary": "حضرت موسیٰ علیہ السلام کو فرعون کی غلامی سے بنی اسرائیل کو آزاد کرانے اور توحید کی دعوت دینے کے لیے بھیجا گیا۔",
    "story": [
      "حضرت موسیٰ علیہ السلام ظالم فرعون کے دور میں پیدا ہوئے۔ اللہ نے آپ کو بچپن میں دریا کی لہروں سے بچایا اور دشمن (فرعون) کے محل ہی میں آپ کی پرورش کا انتظام فرمایا۔",
      "جوان ہونے کے بعد کوہِ طور پر آپ کو نبوت عطا ہوئی اور حکم ملا کہ فرعون کے پاس جا کر اسے اللہ کی بندگی کی دعوت دیں اور بنی اسرائیل کو رہا کرائیں۔",
      "فرعون نے تکبر کیا اور دعوت رد کر دی۔ اللہ نے آپ کو 'یدِ بیضا' (روشن ہاتھ) اور 'عصا' کے معجزات عطا فرمائے جو اژدہا بن جاتا تھا۔",
      "آخر کار اللہ کے حکم سے آپ بنی اسرائیل کو لے کر مصر سے نکلے۔ اللہ نے سمندر کو پھاڑ کر آپ کے لیے راستہ بنا دیا اور فرعون کو اس کے لشکر سمیت غرق کر دیا۔",
      "حضرت موسیٰ علیہ السلام نے اپنی قوم کی رہنمائی فرمائی اور اللہ سے تورات حاصل کی۔ آپ کی زندگی ظلم کے خلاف ڈٹ جانے کا سبق دیتی ہے۔"
    ],
    "lessons": [
      "اللہ ہمیشہ اپنے مومن بندوں کی مدد فرماتا ہے۔",
      "حق ہمیشہ باطل اور ظلم پر غالب آتا ہے۔",
      "قوم کی قیادت کے لیے صبر اور حوصلہ نہایت ضروری ہے۔"
    ],
    "refs": ["سورہ القصص 3-46", "سورہ طہ 9-98", "سورہ یونس 75-92"]
  },

  "yusuf": {
    "id": "yusuf",
    "name": "حضرت یوسف علیہ السلام",
    "title": "قصہ حضرت یوسف علیہ السلام",
    "summary": "حضرت یوسف علیہ السلام کا قصہ صبر، پاکدامنی، حسنِ اخلاق اور اللہ پر کامل بھروسے کی داستان ہے۔",
    "story": [
      "حضرت یوسف علیہ السلام حضرت یعقوب علیہ السلام کے صاحبزادے تھے۔ آپ کے بھائیوں نے حسد کی وجہ سے آپ کو کنویں میں ڈال دیا، لیکن اللہ نے آپ کو بچا لیا۔",
      "آپ مصر کے بازار میں غلام بنا کر بیچے گئے اور وہاں اپنی پاکدامنی اور بلند کردار کی وجہ سے پہچانے گئے۔ جھوٹی تہمت لگنے کے باوجود آپ نے قید خانہ قبول کیا لیکن گناہ نہیں۔",
      "قید خانے میں اللہ نے آپ کو خوابوں کی تعبیر کا علم عطا فرمایا، جو آخر کار آپ کی رہائی اور شاہِ مصر کے دربار تک رسائی کا ذریعہ بنا۔",
      "مصر میں قحط کی پیشگوئی اور اس کی تدبیر بتانے پر آپ کو ملک کا وزیرِ خزانہ بنایا گیا۔ آپ نے بڑی حکمت سے ملک کو قحط سے بچایا۔",
      "آخر کار آپ کے وہ بھائی جنہوں نے ظلم کیا تھا، آپ کے سامنے آئے اور آپ نے انہیں معاف فرما دیا۔ یہ قصہ ثابت کرتا ہے کہ صبر کا پھل ہمیشہ میٹھا ہوتا ہے۔"
    ],
    "lessons": [
      "صبر اللہ کی نصرت اور مدد لاتا ہے۔",
      "برائی کا جواب اچھائی اور درگزر سے دینا انبیاء کا شیوہ ہے۔",
      "اللہ اپنے بندوں کے لیے بہترین منصوبہ ساز ہے۔"
    ],
    "refs": ["سورہ یوسف (مکمل سورہ)"]
  },

  "yunus": {
    "id": "yunus",
    "name": "حضرت یونس علیہ السلام",
    "title": "قصہ حضرت یونس علیہ السلام",
    "summary": "حضرت یونس علیہ السلام وہ نبی ہیں جنہیں مچھلی کے پیٹ میں آزمایا گیا اور آپ کی توبہ کی برکت سے پوری قوم عذاب سے بچ گئی۔",
    "story": [
      "حضرت یونس علیہ السلام کو نینویٰ کے لوگوں کی طرف بھیجا گیا۔ جب انہوں نے بات نہ مانی تو آپ اللہ کے حتمی حکم کا انتظار کیے بغیر غصے میں شہر سے نکل گئے۔",
      "آپ ایک کشتی میں سوار ہوئے جو طوفان میں گھیر گئی۔ قرعہ اندازی میں آپ کا نام نکلا اور آپ کو سمندر میں ڈال دیا گیا، جہاں اللہ کے حکم سے ایک بڑی مچھلی نے آپ کو نگل لیا۔",
      "مچھلی کے پیٹ کے اندھیروں اور سمندر کی گہرائی میں آپ نے نہایت عاجزی سے دعا مانگی: 'لا الہ الا انت سبحانک انی کنت من الظلمین' (تیرے سوا کوئی معبود نہیں، تو پاک ہے، بے شک میں ہی قصوروار ہوں)۔",
      "اللہ نے آپ کی دعا قبول فرمائی اور مچھلی کو حکم دیا کہ وہ آپ کو کنارے پر اگل دے۔ اللہ نے آپ کی حفاظت کے لیے وہاں بیل دار پودا اگا دیا۔",
      "اس کے بعد آپ اپنی قوم کی طرف واپس گئے، وہ سب ایمان لا چکے تھے اور اللہ نے ان سے عذاب ٹال دیا۔ یہ قصہ توبہ کی طاقت کا بہترین سبق ہے۔"
    ],
    "lessons": [
      "دعوت کے کام میں کبھی مایوس نہیں ہونا چاہیے۔",
      "اللہ اپنے گناہگار بندوں کی سچی توبہ ہمیشہ قبول فرماتا ہے۔",
      "مشکل وقت میں ذکر و دعا ہی مومن کا سہارا ہے۔"
    ],
    "refs": ["سورہ یونس 98", "سورہ الانبیاء 87-88", "سورہ الصافات 139-148"]
  },

  "ayyub": {
    "id": "ayyub",
    "name": "حضرت ایوب علیہ السلام",
    "title": "قصہ حضرت ایوب علیہ السلام",
    "summary": "حضرت ایوب علیہ السلام بیماری، مال و دولت اور اولاد کی محرومی کے باوجود بے مثال صبر کرنے والے نبی ہیں۔",
    "story": [
      "حضرت ایوب علیہ السلام ایک خوشحال، صحت مند اور بڑے خاندان والے نبی تھے۔ اللہ نے آپ کو مال، اولاد اور صحت کی رخصتی سے آزمایا۔",
      "آپ ایک طویل عرصے تک سخت بیماری میں مبتلا رہے، یہاں تک کہ لوگ آپ سے دور ہو گئے، لیکن آپ کی زبان پر کبھی شکوہ نہ آیا اور آپ اللہ کی عبادت میں مگن رہے۔",
      "برسوں کے صبر کے بعد آپ نے نہایت عاجزی سے اللہ سے التجا کی کہ 'مجھے تکلیف پہنچی ہے اور تو سب سے بڑھ کر رحم کرنے والا ہے'۔",
      "اللہ نے آپ کی دعا قبول فرمائی اور حکم دیا کہ اپنا پاؤں زمین پر ماریں۔ وہاں سے چشمہ پھوٹا جس کے پانی سے آپ کی بیماری دور ہو گئی۔ اللہ نے آپ کو پہلے سے زیادہ مال اور اولاد عطا فرمائی۔",
      "حضرت ایوب علیہ السلام کا صبر رہتی دنیا تک آزمائش میں گھرے لوگوں کے لیے ایک مینارِ نور ہے۔"
    ],
    "lessons": [
      "صبر آزمائش سے نکلنے کی کنجی ہے۔",
      "تکلیف اللہ کی ناراضگی نہیں بلکہ بندے کے امتحان کا ذریعہ ہو سکتی ہے۔",
      "اللہ کی رحمت صبر کرنے والوں کے بہت قریب ہوتی ہے۔"
    ],
    "refs": ["سورہ الانبیاء 83-84", "سورہ ص 41-44"]
  },

  "daud": {
    "id": "daud",
    "name": "حضرت داؤد علیہ السلام",
    "title": "قصہ حضرت داؤد علیہ السلام",
    "summary": "حضرت داؤد علیہ السلام ایک عظیم بادشاہ اور نبی تھے جنہیں اللہ نے طاقت، حکمت اور زبور عطا فرمائی۔",
    "story": [
      "حضرت داؤد علیہ السلام کو اللہ نے غیر معمولی طاقت عطا فرمائی تھی۔ آپ نے کم عمری میں ظالم جالوت کو اللہ کے حکم سے شکست دی اور اسے قتل کیا۔",
      "اللہ نے آپ کو بادشاہت اور نبوت دونوں سے نوازا۔ آپ عدل و انصاف کے ساتھ حکومت کرتے تھے اور اللہ نے آپ پر 'زبور' نازل فرمائی۔",
      "جب آپ اللہ کی حمد و ثناء کرتے تو پہاڑ اور پرندے بھی آپ کے ساتھ تسبیح پڑھتے تھے۔ اللہ نے آپ کے لیے لوہے کو نرم کر دیا تھا جس سے آپ زرہیں بناتے تھے۔",
      "حضرت داؤد علیہ السلام کثرت سے عبادت کرنے والے تھے۔ آپ ایک دن روزہ رکھتے اور ایک دن افطار کرتے تھے (صومِ داؤدی) اور رات کا ایک حصہ عبادت میں گزارتے۔",
      "آپ کا قصہ سکھاتا ہے کہ طاقت اور اقتدار کے باوجود بندے کو اللہ کا شکر گزار اور عاجز رہنا چاہیے۔"
    ],
    "lessons": [
      "حکمران کو عادل اور خدا ترس ہونا چاہیے۔",
      "دنیاوی طاقت اللہ کی بندگی میں رکاوٹ نہیں بننی چاہیے۔",
      "اللہ کی تسبیح اور ذکر روح کی غذا ہے۔"
    ],
    "refs": ["سورہ ص 17-26", "سورہ البقرہ 251"]
  },

  "sulaiman": {
    "id": "sulaiman",
    "name": "حضرت سلیمان علیہ السلام",
    "title": "قصہ حضرت سلیمان علیہ السلام",
    "summary": "حضرت سلیمان علیہ السلام وہ عظیم بادشاہ نبی ہیں جنہیں اللہ نے پرندوں کی زبان اور جنات پر حکومت عطا فرمائی۔",
    "story": [
      "حضرت سلیمان علیہ السلام حضرت داؤد علیہ السلام کے بیٹے تھے اور آپ کو اپنے والد کی وراثت میں نبوت اور حکومت دونوں ملیں۔ اللہ نے ہواؤں، جنات اور انسانوں کو آپ کے تابع کر دیا تھا۔",
      "آپ جانوروں اور پرندوں کی بولیاں سمجھتے تھے۔ ایک بار آپ نے چیونٹی کی بات سنی اور اللہ کا شکر ادا کیا کہ اس نے آپ کو اتنی نعمتیں عطا فرمائیں۔",
      "آپ نے اپنی حکومت کو توحید کی اشاعت کے لیے استعمال کیا۔ آپ نے ملکہ سبا (بلقیس) کو خط لکھ کر اللہ کی طرف بلایا، جس کے بعد وہ اور ان کی قوم ایمان لے آئے۔",
      "اتنی عظیم سلطنت کے باوجود آپ نہایت منکسر المزاج تھے اور ہر نعمت کو اللہ کا فضل قرار دیتے تھے۔",
      "آپ کی وفات اس حالت میں ہوئی کہ آپ اپنے عصا کے سہارے کھڑے تھے۔ جنات کو آپ کی وفات کا علم تب ہوا جب دیمک نے عصا کو کھا لیا۔ یہ اس بات کی دلیل ہے کہ غیب کا علم صرف اللہ کے پاس ہے۔"
    ],
    "lessons": [
      "اقتدار اللہ کی طرف سے ایک امانت ہے۔",
      "نعمت ملنے پر عاجزی اور شکر گزاری لازمی ہے۔",
      "غیب کا علم صرف اللہ کے پاس ہے، جنات یا انسان کے پاس نہیں۔"
    ],
    "refs": ["سورہ النمل 15-44", "سورہ سبا 12-14"]
  },

  "isa": {
    "id": "isa",
    "name": "حضرت عیسیٰ علیہ السلام",
    "title": "قصہ حضرت عیسیٰ علیہ السلام",
    "summary": "حضرت عیسیٰ علیہ السلام اللہ کے وہ جلیل القدر نبی ہیں جو بغیر باپ کے معجزانہ طور پر پیدا ہوئے اور بنی اسرائیل کی طرف بھیجے گئے۔",
    "story": [
      "حضرت عیسیٰ علیہ السلام کی پیدائش حضرت مریم کے بطن سے بغیر کسی باپ کے ہوئی، جو اللہ کی قدرت کی ایک عظیم نشانی ہے۔",
      "آپ نے شیر خوارگی (بچپن) میں کلام فرمایا تاکہ اپنی والدہ کی پاکدامنی ثابت کر سکیں۔ آپ نے بنی اسرائیل کو خالص توحید کی دعوت دی۔",
      "اللہ نے آپ کو عظیم معجزات دیے: آپ مادرزاد اندھے اور کوڑھی کو اللہ کے حکم سے ٹھیک کر دیتے تھے اور مردوں کو زندہ کر دیتے تھے۔ آپ مٹی سے پرندہ بنا کر اس میں پھونک مارتے تو وہ اللہ کے حکم سے اڑنے لگتا۔",
      "آپ کی قوم کے کچھ لوگوں نے آپ کی مخالفت کی اور آپ کو شہید کرنے کا منصوبہ بنایا، لیکن اللہ نے آپ کو آسمان پر اٹھا لیا اور دشمن ناکام رہے۔",
      "اسلامی عقیدے کے مطابق حضرت عیسیٰ علیہ السلام قیامت کے قریب دوبارہ دنیا میں تشریف لائیں گے جو کہ قیامت کی بڑی نشانیوں میں سے ایک ہے۔"
    ],
    "lessons": [
      "معجزات صرف اللہ کے حکم اور مرضی سے ظاہر ہوتے ہیں۔",
      "توحید تمام انبیاء کی دعوت کا خلاصہ ہے۔",
      "اللہ اپنے مخلص بندوں کی حفاظت فرماتا ہے۔"
    ],
    "refs": ["سورہ مریم 16-36", "سورہ آل عمران 45-55", "سورہ المائدہ 110"]
  },

  "muhammad": {
    "id": "muhammad",
    "name": "حضرت محمد ﷺ",
    "title": "سیرتِ طیبہ حضرت محمد ﷺ",
    "summary": "حضرت محمد ﷺ اللہ کے آخری نبی اور رسول ہیں جنہیں رہتی دنیا تک تمام انسانوں کے لیے 'رحمت اللعالمین' بنا کر بھیجا گیا۔",
    "story": [
      "حضرت محمد ﷺ مکہ مکرمہ میں یتیم پیدا ہوئے۔ آپ اپنی سچائی اور دیانتداری کی وجہ سے نبوت سے پہلے ہی 'الصادق' اور 'الامین' کے لقب سے مشہور تھے۔",
      "چالیس سال کی عمر میں غارِ حرا میں آپ پر پہلی وحی نازل ہوئی۔ آپ کو حکم دیا گیا کہ لوگوں کو ایک اللہ کی عبادت کی طرف بلائیں اور شرک کا خاتمہ کریں۔",
      "آپ نے مکہ میں شدید مظالم اور رکاوٹوں کا سامنا کیا لیکن آپ کے پائے استقلال میں لغزش نہ آئی۔ آپ نے نہایت صبر اور حکمت سے دین کی دعوت جاری رکھی۔",
      "آپ نے مدینہ منورہ ہجرت فرمائی اور وہاں ایک مثالی اسلامی معاشرہ قائم کیا جو عدل و انصاف اور بھائی چارے پر مبنی تھا۔ آپ کے اخلاقِ حسنہ کی بدولت اسلام دنیا بھر میں پھیل گیا۔",
      "آپ ﷺ اخلاق، عبادت، قیادت اور انسانیت کے لیے کامل نمونہ ہیں۔ آپ پر نبوت کا سلسلہ ختم کر دیا گیا، آپ 'خاتم النبیین' ہیں۔"
    ],
    "lessons": [
      "اچھے اخلاق ہی دین کی بنیاد اور تبلیغ کا سب سے بڑا ذریعہ ہیں۔",
      "صبر اور استقامت سے ہی کامیابی حاصل ہوتی ہے۔",
      "رسول اللہ ﷺ کی زندگی ہر شعبے میں انسان کے لیے بہترین مشعلِ راہ ہے۔"
    ],
    "refs": ["سورہ الاحزاب 21", "سورہ الانبیاء 107", "سورہ الفتح 29"]
  }
}